title: Control.exe Used to Spawn Process from Alternate Data Stream
id: ba30edad-77f8-45d5-ac8c-9649a0fed50c
name: control_exe_used_to_spawn_process_from_ads
status: experimental #Select one: stable, test, experimental, deprecated, unsupported. NOTE: All new rules must start with experimental
description: Detect usage of control.exe to execute a file stored in the Alternate Data Stream (ADS)
author: p-o-s-t
references:
    - https://pentestlab.blog/2017/05/24/applocker-bypass-control-panel/
    - https://docs.microsoft.com/en-us/windows/desktop/shell/executing-control-panel-items 
date: 2026-02-08
logsource:
    category: process_creation
    product: windows
detection:
    selection_control:
        ParentImage|endswith: '\control.exe'
        ParentCommandLine|re: '[A-Za-z]\:\\.+:.+\.\w+'
    selection_child_proc:
        Image|exists: true
    condition: all of selection_*
fields:
    - ParentCommandLine
    - CommandLine
    - CurrentDirectory
level: medium # low/medium/high/critical
tags:
    - attack.execution
    - attack.t1218.002
scope:
    - Windows Vista and later